Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/Forms/ФормаНастройкиЗаполненияРеквизитовПостобработки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецУникальныйИдентификатор = Параметры.УникальныйИдентификатор;
	
	Заголовок = Параметры.Заголовок;
	
	КлючСвязи = Параметры.КлючСвязи;
	ТипТаблицы = Параметры.ТипТаблицы;
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	ИмяМетаданныхДокумента = Параметры.ИмяМетаданныхДокумента;
	
	ЗагрузитьСписокВыбораРеквизитов();
	
	Попытка
		СкопироватьНастройкиЗаполненияРеквизитов(Параметры.АдресНастройкиЗаполненияРеквизитов);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Настройки документов'"), , 
			Метаданные.Справочники.SUI_НастройкиДокументовОбмена.Формы.ФормаНастройкиЗаполненияРеквизитовПостобработки, , 
			ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Это таблица
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		
		//
		
	Иначе
		
		Элементы.ГруппаТаблица.Видимость = Ложь;
		
	КонецЕсли;
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.SUI_ВыборЗначения" И 
		Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.Значение = ПолучитьЗначениеСтрокойXML(ВыбранноеЗначение);
		
		Если Не ПустаяСтрока(Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.Значение) Тогда
			Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.ЗначениеПоТипу = ВыбранноеЗначение;
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаНастройкиЗаполненияРеквизитов Из НастройкиЗаполненияРеквизитов Цикл
		
		Если ПустаяСтрока(СтрокаНастройкиЗаполненияРеквизитов.Реквизит) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбран реквизит'"), , "НастройкиЗаполненияРеквизитовРеквизит", , Отказ);
		ИначеЕсли ПустаяСтрока(СтрокаНастройкиЗаполненияРеквизитов.Значение) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Не выбрано значение заполнения для реквизита ""%1""'"), СтрокаНастройкиЗаполненияРеквизитов.Реквизит), , 
				"НастройкиЗаполненияРеквизитовЗначениеПоТипу", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиЗаполненияРеквизитов

&НаКлиенте
Процедура НастройкиЗаполненияРеквизитовРеквизитОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.Реквизит <> ВыбранноеЗначение Тогда
		Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.ЗначениеПоТипу = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗаполненияРеквизитовЗначениеПоТипуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.ЗначениеПоТипу) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОписаниеРеквизита = ОписаниеРеквизитов.НайтиСтроки(Новый Структура("Имя", ТекущиеДанные.Реквизит));
		
		Если ОписаниеРеквизита.Количество() > 0 Тогда
			
			ПараметрыОткрытияВыбора = Новый Структура();
			ПараметрыОткрытияВыбора.Вставить("ТекущееЗначени", Элементы.НастройкиЗаполненияРеквизитов.ТекущиеДанные.ЗначениеПоТипу);
			ПараметрыОткрытияВыбора.Вставить("ОграничениеТипа", ОписаниеРеквизита[0].Тип);
			
			ОткрытьФорму("ОбщаяФорма.SUI_ВыборЗначения", ПараметрыОткрытияВыбора, ЭтотОбъект, УникальныйИдентификатор);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
	
	ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьСписокВыбораРеквизитов()
	
	ОписаниеРеквизитовДерево = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяМетаданныхДокумента);
	
	Если ЗначениеЗаполнено(КлючСвязи) Тогда
		ОписаниеРеквизитовДерево = ОписаниеРеквизитовДерево.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки.Найти(ИмяТабличнойЧасти, "Имя", Ложь);
		ЭтоТаблица = Истина;
	Иначе
		ОписаниеРеквизитовДерево = ОписаниеРеквизитовДерево.Строки.Найти("Реквизиты", "Имя", Ложь);
		ЭтоТаблица = Ложь;
	КонецЕсли;
	
	Если ОписаниеРеквизитовДерево <> Неопределено Тогда
		
		Для Каждого ОписаниеРеквизитаИзДерева Из ОписаниеРеквизитовДерево.Строки Цикл
			
			Если (Не ЭтоТаблица И (ОписаниеРеквизитаИзДерева.Имя = "Ссылка" Или ОписаниеРеквизитаИзДерева.Имя = "Проведен")) Или
				(ЭтоТаблица И ОписаниеРеквизитаИзДерева.Имя = "НомерСтроки") Тогда
				Продолжить;
			КонецЕсли;
			
			Элементы.НастройкиЗаполненияРеквизитовРеквизит.СписокВыбора.Добавить(ОписаниеРеквизитаИзДерева.Имя, 
				ОписаниеРеквизитаИзДерева.Представление + " (" + ОписаниеРеквизитаИзДерева.Имя + ")");
			
			СтрокаОписаниеРеквизитов = ОписаниеРеквизитов.Добавить();
			СтрокаОписаниеРеквизитов.Имя = ОписаниеРеквизитаИзДерева.Имя;
			СтрокаОписаниеРеквизитов.Тип = ОписаниеРеквизитаИзДерева.Тип;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиЗаполненияРеквизитов(Знач Источник)
	
	ОписаниеТипаТаблицаЗначений = Новый ОписаниеТипов("ТаблицаЗначений");
	
	Если ТипЗнч(Источник) = Тип("Строка") И ЭтоАдресВременногоХранилища(Источник) Тогда
		Источник = ОписаниеТипаТаблицаЗначений.ПривестиЗначение(ПолучитьИзВременногоХранилища(Источник));
	Иначе
		Источник = ОписаниеТипаТаблицаЗначений.ПривестиЗначение(Источник);
	КонецЕсли;
	
	Для Каждого СтрокаИсточника Из Источник Цикл
		
		СтрокаНастройкиЗаполненияРеквизитов = НастройкиЗаполненияРеквизитов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройкиЗаполненияРеквизитов, СтрокаИсточника);
		
		Если Не ПустаяСтрока(СтрокаИсточника.Значение) Тогда
			
			ОписаниеРеквизита = ОписаниеРеквизитов.НайтиСтроки(Новый Структура("Имя", СтрокаНастройкиЗаполненияРеквизитов.Реквизит));
			
			Если ОписаниеРеквизита = Неопределено Тогда
				СтрокаНастройкиЗаполненияРеквизитов.Значение = Неопределено;
			Иначе
				СтрокаНастройкиЗаполненияРеквизитов.ЗначениеПоТипу = ОписаниеРеквизита[0].Тип.ПривестиЗначение(
					ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаНастройкиЗаполненияРеквизитов.Значение));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСтрокойXML(Значение)
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Значение);
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактированиеПодтверждениеСохранения(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		ЗавершитьНастройкуИЗакрыть(Подтверждение = КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьНастройкуИЗакрыть(СРезультатом = Истина)
	
	Результат = Неопределено;
	
	Если СРезультатом Тогда
		
		Если ПроверитьЗаполнение() Тогда
			Результат = СформироватьРезультатНастройки();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьРезультатНастройки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("КлючСвязи", КлючСвязи);
	Результат.Вставить("АдресНастройкиЗаполненияРеквизитов", 	"");
	
	ДополнитьРезультатНастройкиНаСервере(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДополнитьРезультатНастройкиНаСервере(Результат)
	
	Если ЗначениеЗаполнено(ВладелецУникальныйИдентификатор) Тогда
		
		НастройкиЗаполненияРеквизитовТаблица = РеквизитФормыВЗначение("НастройкиЗаполненияРеквизитов", Тип("ТаблицаЗначений"));
		НастройкиЗаполненияРеквизитовТаблица.Свернуть("Реквизит,Значение,ПриРасхождении");
		
		Результат.АдресНастройкиЗаполненияРеквизитов = ПоместитьВоВременноеХранилище(
			НастройкиЗаполненияРеквизитовТаблица, ВладелецУникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
